# 6. (МОДУЛЬ 3) В проекте создать новый модуль 3seq.py. Задание:
#
# Пользователь вводит элементы 1-го списка (по очереди как в МОДУЛЬ 1 или вместе как в МОДУЛЬ 2)
# Затем он вводит элементы 2-го списка
# Удалить из первого списка элементы присутствующие во 2-ом и вывести результат на экран
# Пример работы: Введите элементы 1-го списка: 1,2,3,4,5
# Введите элементы 2-го списка: 2,5
# Результат: 1,3,4
#
# Предлагаю проверить работу программы на разных списках, чтобы убедиться что она работает верно

numbers1 = input('Введите элементы 1-го списка через запятую: ')
numbers2 = input('Введите элементы 2-го списка через запятую: ')
numbers1 = numbers1.replace(",", "")
numbers1 = list(map(int,numbers1))
print(numbers1)
numbers2 = numbers2.replace(",", "")
numbers2 = list(map(int,numbers2))
print(numbers2)

for x in numbers2:
  numbers1.remove(x)
print(numbers1)